
// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------

import * as Redux from "redux";

import { ReducerTemplateState, reducerTemplateReducer, } from "@client/redux/reducer/template";

import middlewareTemplate from "@client/redux/middleware/template";

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------

// ストア状態受信構造体
export interface ReduxStoreState {
	stateTemplate: ReducerTemplateState;
}

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------

// ストア作成
export const store: Redux.Store = Redux.createStore(Redux.combineReducers({
	stateTemplate: reducerTemplateReducer,
}), Redux.applyMiddleware(
	middlewareTemplate
));

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// ----------------------------------------------------------------

